inst/doc-paired/paired.org
#+TITLE: Performing GPC in a paired design
#+Author: Brice Ozenne
#+BEGIN_SRC R :exports none :results quiet :session *R* :cache no
options(width = 95)
if(system("whoami",intern=TRUE)=="bozenne"){  
  setwd("~/Documents/GitHub/BuyseTest/inst/doc-paired/")
}else if(system("whoami",intern=TRUE)=="sund\\hpl802"){  
  setwd("c:/Users/hpl802/Documents/Github/BuyseTest/inst/doc-paired/")
}
library(survival) ## avoid messages when loading the package later on
library(ggplot2) ## avoid messages when loading the package later on
library(prodlim) ## avoid messages when loading the package later on
#+END_SRC

#+RESULTS:

This vignette describes how to use Generalized Pairwise comparisons
(GPC) in a paired design. This for instance corresponds to the
Diabetic Retinopathy Study (DRS) contained in the survival \Rlogo
package where 197 patients had one of their eye randomized to laser
treatment while the other did not receive any treatment:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
data(diabetic, package = "survival")
head(diabetic)
#+END_SRC

#+RESULTS:
:   id laser age   eye trt risk  time status
: 1  5 argon  28  left   0    9 46.23      0
: 2  5 argon  28 right   1    9 46.23      0
: 3 14 xenon  12  left   1    8 42.50      0
: 4 14 xenon  12 right   0    6 31.30      1
: 5 16 xenon   9  left   1   11 42.27      0
: 6 16 xenon   9 right   0   11 42.27      0

The outcome was time to blindness (visual acuity drop below a certain
threshold). In the real study =status= equal to 0 mixes death and
censoring (due to drop-out or end of study) but this complication will
be neglected here for simplicity.


\bigskip

We will replicate some of the analyzes presented in
cite:matsouaka2022robust. In this paper they split the dataset into
juvenile and adult patients:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
diabetic$juvenile <- diabetic$age <= 19
library(LMMstar)
summarize(age ~ juvenile, data = diabetic[!duplicated(diabetic$id),])
#+END_SRC

#+RESULTS:
:   juvenile observed missing     mean        sd min q1 median    q3 max
: 1    FALSE       83       0 35.30120 11.242054  20 25     34 45.00  58
: 2     TRUE      114       0 10.21053  4.713892   1  7     10 13.75  19

and we will focus on the juvenile patients:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
diabeticJ <- diabetic[diabetic$juvenile,]
#+END_SRC

#+RESULTS:


\clearpage

