inst/doc-paired/paired.org
* Wald methods (Gehan scoring rule)

To mimic the methodology underlying the results presented in Table 1
of cite:matsouaka2022robust, we perform GPC stratified by patient
using the Gehan scoring rule:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(BuyseTest)
e.BTjuv <- BuyseTest(trt ~ tte(time,status) + strata(id, match = TRUE), 
                     data = diabeticJ, trace = FALSE,
                     scoring.rule =  "Gehan")
model.tables(e.BTjuv, percentage = FALSE)
#+END_SRC

#+RESULTS:
:   endpoint total favorable unfavorable neutral uninf     Delta   lower.ci  upper.ci    p.value
: 1     time   114        39          21       3    51 0.1578947 0.02591623 0.2844633 0.01922741

Indeed this scoring rule does not involve any extra-modeling, only
evaluating the patient specific net benefit and averaging them:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
mean(coef(e.BTjuv, strata = TRUE))
#+END_SRC

#+RESULTS:
: [1] 0.1578947

cite:matsouaka2022robust propose to estimate the standard error as:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
N <- nobs(e.BTjuv)["pairs"]
pw <- coef(e.BTjuv, statistic = "favorable")
pl <- coef(e.BTjuv, statistic = "unfavorable")
sqrt((pw + pl - (pw - pl)^2)/N)
#+END_SRC

#+RESULTS:
:       time 
: 0.06631828

which matches what =BuyseTest= output:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
confint(e.BTjuv)
#+END_SRC

#+RESULTS:
:       estimate         se   lower.ci  upper.ci null    p.value
: time 0.1578947 0.06631828 0.02591623 0.2844633    0 0.01922741

By default =confint= uses a hyperbolic tangent to compute confidence
intervals (CIs), which will then differ from the 'Wald' discussed in
cite:matsouaka2022robust. These 'untransformed Wald' CIs can be
retrieved by setting the argument =transform= to =FALSE=:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
confint(e.BTjuv, transform = FALSE)
#+END_SRC

#+RESULTS:
:       estimate         se   lower.ci  upper.ci null    p.value
: time 0.1578947 0.06631828 0.02791329 0.2878762    0 0.01727214

\clearpage

_Note:_ naively one may think to estimate the standard error as:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
sqrt(var(coef(e.BTjuv, strata = TRUE))/N)
#+END_SRC

#+RESULTS:
:      pairs 
: 0.06661108

This is equivalent (in large samples to the previous formula). Indeed:
#+BEGIN_EXPORT latex
\begin{align*}
&\Prob[X>Y] + \Prob[Y>X] - (\Prob[X>Y] - \Prob[Y>X])^2 \\
=& \Prob[X>Y] + \Prob[Y>X] - \Prob[X>Y]^ - \Prob[Y>X]^2 + 2 \Prob[X>Y] \Prob[Y>X] \\
=& \Prob[X>Y](1-\Prob[X>Y]) + \Prob[Y>X](1-\Prob[Y>X]) + 2 \Prob[X>Y] \Prob[Y>X] \\
=& \Prob[X>Y](1-\Prob[X>Y]) + \Prob[Y>X](1-\Prob[Y>X]) \\
 & - 2 (0 - \Prob[X>Y] \Prob[Y>X] - \Prob[X>Y] \Prob[Y>X] + \Prob[X>Y] \Prob[Y>X] \\
=& \Var\left[\Ind[X>Y]\right] + \Var\left[\Ind[X<Y]\right] - 2 \Cov\left(\Ind[X>Y],\Ind[X<Y]\right) \\
=& \Var\left[\Ind[X>Y]-\Ind[X<Y]\right] \\
\end{align*}
#+END_EXPORT

There is only a factor =N/(N-1)= difference between the two:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
sqrt(var(coef(e.BTjuv, strata = TRUE))/N) * sqrt((N-1)/N)
#+END_SRC

#+RESULTS:
:      pairs 
: 0.06631828


* MOVER method (Gehan scoring rule)

The method recommended by cite:matsouaka2022robust is the MOVER
approach, which has been developped for a binary scoring rule
(e.g. Gehan). An experimental function with the same name has been
implemented in the BuyseTest package:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
mover(e.BTjuv)
#+END_SRC
#+RESULTS:
:   estimate      lower      upper     pvalue 
: 0.15789474 0.02540421 0.28317729 0.01967878

leading to the same results as those of the table 1 in the original article, up to rounding.

\clearpage

